Revit 2026 API

# CodeCheckingParameterServiceData Class

---

The data needed by code checking server to perform code checking.

SystemObject Autodesk.Revit.DB.StructureCodeCheckingParameterServiceData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CodeCheckingParameterServiceData : IDisposable
```
```vb
Public Class CodeCheckingParameterServiceData
	Implements IDisposable
```
```cpp
public ref class CodeCheckingParameterServiceData : IDisposable
```
```fsharp
type CodeCheckingParameterServiceData =
    class
        interface IDisposable
    end
```

The CodeCheckingParameterServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The current document. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CodeCheckingParameterServiceData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace